Repository: Softcatala/translation-memory-tools
Catalog: latest-memories/tmx/limesurvey-tm.tmx
Source language: en
Languages: ca_es

source: Relevance [Validation] (Default)
ca_es: Relevància [Validació] (Per defecte)

source: Text [Help] (Tip)
ca_es: Text [Ajuda] (Tip)

source: Default:
ca_es: Per defecte:

source: Tip:
ca_es: Ajuda

source: Question attribute
ca_es: Atribut de pregunta

source: Value
ca_es: Valor

source: This variable name has already been used.
ca_es: Aquest nom de variable ja s'està fent servir.

source: Starting in 1.92, variable names should only contain letters, numbers, and underscores; and may not start with a number. This variable name is deprecated.
ca_es: A partir de la versió 1.92, els noms de variable només pden contenir lletres, nombres i guions baixos, i no pot començar amb un nombre. Aquest nom de variable està en desús.

source: This question has at least %s error.
ca_es: Aquesta pregunta té com a mínim %s error.

source: %s question contains errors that need to be corrected
ca_es: %s pregunta té errors que han de ser corregits

source: No syntax errors detected in this survey
ca_es: No s'han detectat errors de sintaxis en aquesta enquesta

source: This group, by itself, does not contain any syntax errors
ca_es: Aquest grup, per si mateix, no conté cap error de sintaxis

source: This question, by itself, does not contain any syntax errors
ca_es: Aquesta pregunta, per si mateixa, no conté cap error de sintaxis

source: Absolute value
ca_es: Valor absolut

source: Arc cosine
ca_es: Arc cosinus

source: addslashes
ca_es: afegirbarres

source: Arc sine
ca_es: Arc sinus

source: Arc tangent of two variables
ca_es: Arc tangent de dues variables

source: Round fractions up
ca_es: Arrodoniment a l'alça de les fraccions

source: Returns true(1) if it is a valid date in gregorian calendar
ca_es: Retorna verdader(1) si és una data válida del calendari gregorià

source: Cosine
ca_es: Cosinus

source: Count the number of answered questions in the list
ca_es: Contar el número de preguntes respostes a la llista

source: Count the number of answered questions in the list equal the first argument
ca_es: Compta el número de respostes contestades a la llista que són iguals al primer argument

source: Count the number of answered questions in the list which pass the critiera (arg op value)
ca_es: Compta el nombre de preguntes contestades en la llista que compleixen el criteri (arg valor op)

source: Format a local date/time
ca_es: Formatejar la data/hora local

source: Calculates the exponent of e
ca_es: Calcula l'exponent de e

source: Display numbers with comma as decimal separator, if needed
ca_es: Si es necessari, mostrar els números amb coma com a separador decimal

source: Round fractions down
ca_es: Arrodoneix els fraccions avall

source: Format a GMT date/time
ca_es: Formatejar una data/hora GMT

source: Convert all HTML entities to their applicable characters (always uses ENT_QUOTES and UTF-8)
ca_es: Convertir totes les entitats HTML als seus caràcters aplicables (sempre utilitza ENT_QUOTES i UTF-8)

source: Convert all applicable characters to HTML entities (always uses ENT_QUOTES and UTF-8)
ca_es: Convertir tots els caràcters aplicables a entitats HTML (sempre utilitza ENT-QUOTES i UTF-8)

source: Convert special characters to HTML entities (always uses ENT_QUOTES and UTF-8)
ca_es: Convertir caràcters especials a entitats HTML (sempre utilitza ENT-QUOTES i UTF-8)

source: Convert special HTML entities back to characters (always uses ENT_QUOTES and UTF-8)
ca_es: Tornar a convertir entitats HTML especials en caràcters (sempre utilitza ENT-QUOTES i UTF-8)

source: Format a local time/date as integer
ca_es: Formatar una hora/data local com a un enter

source: Conditional processing
ca_es: Processament condicional

source: Join array elements with a string
ca_es: Uneix elements agrupats amb una cadena

source: Get the integer value of a variable
ca_es: Obtenir el valor enter d'una variable

source: Determine whether a variable is considered to be empty
ca_es: Determinar si una variable es considerada com a buida

source: Finds whether the type of a variable is float
ca_es: Troba si el tipus d'una variable és flotant

source: Find whether the type of a variable is integer
ca_es: Troba si eltipus de variable és un enter

source: Finds whether a value is not a number
ca_es: Troba si un valor no és un número

source: Finds whether a variable is NULL
ca_es: Troba si una variable és NUL·LA

source: Finds whether a variable is a number or a numeric string
ca_es: Troba si una variable és un número o una cadena numèrica

source: Find whether the type of a variable is string
ca_es: Troba si el tipus d'una variable és una cadena

source: Join strings, return joined string.This function is an alias of implode("",argN)
ca_es: Unir textos, retorna textos units. Aquesta funció és un àlies de: implode("", argN)

source: Return comma-separated list of values
ca_es: Retornar llista de valors separada per comes

source: The logarithm of number to base, if given, or the natural logarithm.
ca_es: El logaritme natural, o bé, si s'indica, el logaritme del número a la base.

source: Strip whitespace (or other characters) from the beginning of a string
ca_es: Eliminar els espais en blanc (o altres caràcters) de l'inici d'una cadena

source: Find highest value
ca_es: Trobar el valor més alt

source: Find lowest value
ca_es: Trobar el valor més baix

source: Get UNIX timestamp for a date (each of the 6 arguments are optional)
ca_es: Obté la marca de temps UNIX (tots els 6 arguments són opcionals)

source: Inserts HTML line breaks before all newlines in a string
ca_es: Insereix salts de línia HTML abans de totes les noves línies en una cadena

source: Format a number with grouped thousands
ca_es: Formata un número amb milers agrupats

source: Get value of pi
ca_es: Obtenir el valor de pi

source: Exponential expression
ca_es: Expressió exponencial

source: Convert a quoted-printable string to an 8 bit string
ca_es: Converteix una cadena de caràcters imprimibles en una cadena de 8 bits

source: Convert a 8 bit string to a quoted-printable string
ca_es: Converteix una cadena de 8 bits en una cadena de caràcters imprimibles

source: Quote meta characters
ca_es: Meta caràcters de quota

source: Generate a random integer
ca_es: Generar un enter aleatori

source: Compare a string to a regular expression pattern
ca_es: Comparar una cadena en un patró d'expressió regular

source: Rounds a number to an optional precision
ca_es: Arrodoneix un nombre a una precisió opcional

source: Strip whitespace (or other characters) from the end of a string
ca_es: Eliminar els espais en blanc (o altres caràcters) del final d'una cadena

source: Sine
ca_es: Sinus

source: Return a formatted string
ca_es: Retornar una cadena formatejada

source: Square root
ca_es: Arrel quadrada

source: Calculate the Sample Standard Deviation for the list of numbers
ca_es: Calcular la desviació estàndar de mostra per a la llista de números

source: Pad a string to a certain length with another string
ca_es: Conecta una cadena a una llargada concreta amb una altra cadena

source: Repeat a string
ca_es: Repeteixi la cadena

source: Replace all occurrences of the search string with the replacement string
ca_es: Canvia totes les aparicions de la cadena cercada per la cadena de canvi

source: Binary safe case-insensitive string comparison
ca_es: Comparació de cadena no sensible a les majúscules binari segura

source: Binary safe string comparison
ca_es: Comparació cadena binari segura

source: Strip HTML and PHP tags from a string
ca_es: Eliminar les etiquetes HTML i PHP d'una cadena

source: Find position of first occurrence of a case-insensitive string
ca_es: Troba la posició de la primera occurència d'una cadena sensible a les majúscules

source: Un-quotes a quoted string
ca_es: Retorna una cadena sense cometes

source: Case-insensitive strstr
ca_es: strstr sensible a les majúscules

source: Get string length
ca_es: Establir la llargada de la cadena

source: Find position of first occurrence of a string
ca_es: Troba la posició de la primera ocurrència d'una cadena

source: Reverse a string
ca_es: Inverteix una cadena

source: Find first occurrence of a string
ca_es: Troba la primera ocurrència d'una cadena

source: Make a string lowercase
ca_es: Converteix la cadena a minúscules

source: Convert a date/time string to unix timestamp
ca_es: Converteix el text de la data/hora a una marca de temps de tipus Unix.

source: Make a string uppercase
ca_es: Converteix la cadena a majúscules

source: Return part of a string
ca_es: Retornat una part de la cadena

source: Calculate the sum of values in an array
ca_es: Calcula la suma dels valors en una matriu

source: Sum the values of answered questions in the list which pass the critiera (arg op value)
ca_es: Suma el nombre de preguntes contestades en la llista que compleixen el criteri (arg valor op)

source: Convert a numerical value using a inputTable and outputTable of numerical values
ca_es: Converteix el valor numèric fent servir una taula d'entrada (inputTable) i una taula de sortida (outputTable) de valors numèrics

source: Return current UNIX timestamp
ca_es: Retornar la marca de temps UNIX actual

source: Strip whitespace (or other characters) from the beginning and end of a string
ca_es: Eliminar els espais en blanc (o altres caràcters) de l'inici o el final d'una cadena

source: Uppercase the first character of each word in a string
ca_es: Posa en majúscula el primer caràcter de cada paraula d'una cadena

source: Returns true if all non-empty responses are unique
ca_es: Retorna cert si totes les respostes no buides són úniques

source: Unable to evaluate binary operator - fewer than 2 entries on stack
ca_es: No s'ha pogut evaluar l'operador binari - menys de 2 entrades a la pila

source: Invalid value(s) on the stack
ca_es: Valor/s invàlid/s a la pila

source: Unable to evaluate unary operator - no entries on stack
ca_es: No s'ha pogut avaluar l'operador unari. No hi ha entrades a la pila

source: Extra tokens found
ca_es: S'han trobat tokens extra

source: Unbalanced equation - values left on stack
ca_es: Equació no equilibrada - valors a l'esquerra de la pila

source: Not a valid expression
ca_es: No és una expressió vàlida

source: Poorly terminated expression - expected a constant or variable
ca_es: Expressió mal acabada - s'esperava una constant o una variable

source: Variable not declared until a later page
ca_es: Variable no declarada fins a la pàgina posterior

source: Undefined variable
ca_es: Variable indefinida

source: Should never get to this line?
ca_es: Mai s'ha d'arribar a aquesta línia?

source: The value of this variable can not be changed
ca_es: El valor d'aquesta variabla no es pot canviar

source: Only variables can be assigned values
ca_es: Només les variables poden tenir valor assignats

source: Expected expressions separated by commas
ca_es: Expressions esperades separades per comes

source: Extra token found after expressions
ca_es: Token extra trobat després de les expressions

source: Undefined function
ca_es: Funció indefinida

source: Expected left parentheses after function name
ca_es: S'esperava un parèntesi esquerre '(' després del nom de la funció

source: Extra comma found in function
ca_es: S'ha trobat una coma extra a la funció

source: Expected right parentheses
ca_es: S'esperava un parèntesi de tancament ')'

source: Extra right parentheses detected
ca_es: S'ha detectat un parèntesi de tancament ')' extra

source: Unsupported syntax
ca_es: Sintaxis no suportada

source: Missing %s closing right parentheses
ca_es: Falta %s parèntesis de tancament

source: Function must have at least %s argument
ca_es: La funció ha de tenir com a mímin %s argument

source: Unsupported number of arguments: %s
ca_es: Número d'arguments no suportat: %s

source: Function does not support %s arguments
ca_es: La funció no suporta %s arguments

source: Function supports this many arguments, where -1=unlimited: %s
ca_es: La funció suporta aquests arguments, on -1=il·limitat: %s

source: Tried to pop value off of empty stack
ca_es: Has provat de eliminar un valor d'una pila buida

source: Invalid PERL Regular Expression: %s
ca_es: Expressió regular PERL no vàlida: %s

source: Not Selected
ca_es: No seleccionat

source: Albanian
ca_es: Albanès

source: Amharic
ca_es: Amhàric

source: Arabic
ca_es: Àrab

source: Armenian
ca_es: Armeni

source: Basque
ca_es: Basc

source: Belarusian
ca_es: Bielorús

source: Bosnian
ca_es: Bosni

source: Bulgarian
ca_es: Búlgar

source: Catalan (Valencian)
ca_es: Català (València)

source: Catalan
ca_es: Català

source: Welsh
ca_es: Gal·lès

source: Chinese (Simplified)
ca_es: Xinès (Simplificat)

source: Chinese (Traditional - Hong Kong)
ca_es: Xinès (Tradicional - Hong Kong)

source: Chinese (Traditional - Taiwan)
ca_es: Xinès (Tradicional - Hong Kong)

source: Croatian
ca_es: Croata

source: Czech
ca_es: Txec

source: Czech (informal)
ca_es: Txec (informal)

source: Danish
ca_es: Danès

source: Dari
ca_es: Persa Dari

source: Dutch
ca_es: Holandès

source: Dutch (informal)
ca_es: Neerlandès (informal)

source: English
ca_es: Anglès

source: Estonian
ca_es: Estoni

source: Finnish
ca_es: Finlandès

source: French
ca_es: Francès

source: Fula
ca_es: Ful

source: Galician
ca_es: Gallec

source: Georgian
ca_es: Georgià

source: German
ca_es: Alemà

source: German (informal)
ca_es: Alemany (informal)

source: Greek
ca_es: Grec

source: Hebrew
ca_es: Hebreu

source: Hungarian
ca_es: Hongarès

source: Icelandic
ca_es: Islandès

source: Indonesian
ca_es: Indonesi

source: Irish
ca_es: Irlandès

source: Italian
ca_es: Italià

source: Italian (informal)
ca_es: Italià (informal)

source: Japanese
ca_es: Japonès

source: Korean
ca_es: Coreà

source: Kurdish (Sorani)
ca_es: Kurd (Sorani)

source: Lithuanian
ca_es: Lituà

source: Latvian
ca_es: Lituà

source: Macedonian
ca_es: Macedoni

source: Mongolian
ca_es: Mongol

source: Malay
ca_es: Malai

source: Maltese
ca_es: Maltès

source: Norwegian (Bokmal)
ca_es: Norueg (Bokmal)

source: Norwegian (Nynorsk)
ca_es: Norueg (Nynorsk)

source: Occitan
ca_es: Occità

source: Pashto
ca_es: Paixtu

source: Persian
ca_es: Persa

source: Polish
ca_es: Polac

source: Portuguese
ca_es: Portuguès

source: Portuguese (Brazilian)
ca_es: Portuguès (Brasil)

source: Russian
ca_es: Rus

source: Romanian
ca_es: Romanès

source: Slovak
ca_es: Eslovè

source: Sinhala
ca_es: Singalès

source: Slovenian
ca_es: Eslovè

source: Serbian (Cyrillic)
ca_es: Serbi (ciríl·lic)

source: Serbian (Latin)
ca_es: Serbi (llatí)

source: Spanish
ca_es: Espanyol

source: Spanish (Argentina)
ca_es: Espanyol (Argentina)

source: Spanish (Argentina) (Informal)
ca_es: Espanyol (Argentina) (informal)

source: Spanish (Chile)
ca_es: Espanyol (Xile)

source: Spanish (Mexico)
ca_es: Espanyol (Mèxic)

source: Swedish
ca_es: Suec

source: Tamil
ca_es: Tàmil

source: Turkish
ca_es: Turc

source: Thai
ca_es: Tailandès

source: Vietnamese
ca_es: Vietnamita

source: Dot (.)
ca_es: Punt (.)

source: Comma (,)
ca_es: Coma (,)

source: The LimeSurvey database is being upgraded
ca_es: La base de dades de LimeSurvey està sent millorada

source: Please be patient...
ca_es: Siusplau, sigui pacient...

source: Moving user templates to new location at %s...
ca_es: Moure les plantilles d'usuari a una nova ubicació a %s...

source: An non-recoverable error happened during the update. Error details:
ca_es: Ha ocorregut un error no recuperable durant l'actualització. Detalls de l'error:

source: Database update finished (%s)
ca_es: Actualització de la base de dades finalitzada (%s)

source: Some user templates can not be updated, please add the placeholder {TEMPLATEJS} in your startpage.pstpl manually.
ca_es: Algunes plantilles no poden ser actualitzades, si us plau, afegeixi el 'placeholder' {TEMPLATEJS} a la página startpage.pstpl manualment.

source: Template(s) to be verified :
ca_es: Plantilla/es per verificar:

source: All %s user templates updated.
ca_es: Totes les %s plantilles s'han actualitzat.

source: Database has been successfully upgraded to version %s
ca_es: S'ha actualitzat correctament la base de dades a la versió %s

source: Please fix this error in your database and try again
ca_es: Si us plau, arregli aquest error a la seva base de dades i provi de nou

source: Database upgrade
ca_es: Millora de la base de dades

source: Please verify the following information before continuing with the database upgrade:
ca_es: Si us plau verifiqueu la informació següent abans de continuar amb l'actualització de la base de dades:

source: Root URL
ca_es: URL principal

source: Click here to continue
ca_es: Cliqui aquí per continuar

source: Start HTML editor in a popup window
ca_es: Inicia l'editor HTML en una nova finestra emergent

source: Give focus to the HTML editor popup window
ca_es: Porta el focus a l'editor HTML de la finestra emergent

source: This group does not contain any question(s).
ca_es: Aquest grup no conté cap pregunta.

source: This question has no subquestions.
ca_es: Aquesta pregunta no té subpreguntes.

source: This question has no answers.
ca_es: Aquesta pregunta no té respostes.

source: This question does not have a question 'type' set.
ca_es: Aquesta pregunta encara no té assignat el 'tipo' de la pregunta.

source: This question requires answers, but none are set.
ca_es: Aquesta pregunta requereix respostes, però no se n'ha indicat cap.

source: This question requires a second answer set but none is set.
ca_es: Aquesta pregunta requereix un segon conjunt de respostes, però no se n'ha indicat cap.

source: This question has a condition set, however the condition is based on a question that appears after it.
ca_es: Aquesta pregunta té una condició, però aquesta condició està basada en una pregunta que apareix després d'aquesta.

source: This file is not a LimeSurvey question file. Import failed.
ca_es: Aquest arxiu no és un fitxer de preguntes de LimeSurvey. Ha fallat la importació.

source: This file is too old. Only files from LimeSurvey version 1.50 (DBVersion 112) and newer are supported.
ca_es: Aquest arxiu és molt antic. Només els arxius més recents que LimeSurvey versió 1.50 (DBVersion 112) estan suportats.

source: You can't import a group which doesn't support at least the survey base language.
ca_es: No pot importar un grup que no suporta, com a mínim, l'idioma base de l'enquesta.

source: You can't import a question which doesn't support at least the survey base language.
ca_es: No pot importar una pregunta que no suporta com a mínim l'idioma base de l'enquesta.

source: You can't import answers which doesn't support at least the survey base language.
ca_es: No pot importar respostes que no suportin com a mínim l'idioma base de l'enquesta.

source: You can't import label sets which don't support the current survey's base language
ca_es: No es pot importar un conjunt d'etiquetes que no suporta l'idioma base de l'enquesta

source: Faulty line in import - fields and data don't match
ca_es: Línia errònia en l'importació - Els camps i les dades no encaixen

source: The languages of the imported group file must at least include the base language of this survey.
ca_es: Els llenguatges de l'arxiu de grup importat han de contenir com a mínim el llenguatge base de l'enquesta.

source: The languages of the imported question file must at least include the base language of this survey.
ca_es: Com a mínim l'idioma base de l'enquesta ha de figurar entre els idiomes de la pregunta importada.

source: This file is not a LimeSurvey label set file. Import failed.
ca_es: Aquest arxiu no és un arxiu de conjunt d'etiquetes vàlid per LimeSurvey. Ha fallat la importació.

source: Label set was not imported because the same label set already exists.
ca_es: El grup d'etiquetes no s'ha importat perque ja existeix un grup d'etiquetes igual.

source: Existing LID: %s
ca_es: LID existent: %s

source: This file is not a LimeSurvey survey file. Import failed.
ca_es: Aquest fitxer no és un fitxer d'una enquesta de LimeSurvey. La importació ha fallat.

source: Import of this survey file failed
ca_es: Ha fallat la importació del fitxer de l'enquesta

source: File does not contain LimeSurvey data in the correct format.
ca_es: El fitxer no conté un format LimeSurvey vàlid.

source: Template %s not found, please review when activating.
ca_es: No s'ha trobat la plantilla %s, si us plau revisi quan ho activi.

source: A group in the CSV/SQL file is not part of the same survey. The import of the survey was stopped.
ca_es: Un grup de l'arxiu CSV/SQL no forma part de la mateixa enquesta. S'ha aturat la importació de l'enquesta.

source: This is not a valid LimeSurvey survey structure XML file.
ca_es: Aquesta no és una estructura d'enquesta LimeSurvey vàlida d'arxiu XML.

source: This is not a valid token data XML file.
ca_es: Aquest no es un arxiu XML de tokens vàlid.

source: This is not a valid response data XML file.
ca_es: Aquest no es un arxiu XML de resposta vàlid.

source: This is not a valid timings data XML file.
ca_es: Aquest no es un arxiu XML de temps vàlid.

source: Failed to insert survey language
ca_es: Ha fallat l'inserció d'un nou idioma

source: Failed to insert group
ca_es: Ha fallat la inserció del grup

source: Text file row number
ca_es: Número de fila de l'arxiu de text

source: Could not insert question
ca_es: No es poden insertar preguntes

source: Failed to insert question attribute
ca_es: Ha fallat la inserció de l'atribut de pregunta

source: Failed to insert default value
ca_es: Ha fallat la inserció del valor per defecte

source: Could not insert sub question
ca_es: No es pot insertar sub pregunta

source: Could not insert answer
ca_es: No es poden insertar respostes

source: Inserting the label set failed.
ca_es: La inserció del conjunt d'etiquetes ha fallat.

source: Labels updated but with some error
ca_es: S'han actualitzat les etiquetes, però amb alguns errors

source: Labels sucessfully updated
ca_es: Etiquetes actualitzades correctament

source: Can't update labels because you are using duplicated codes
ca_es: No es poden actualitzar les etiquetes ja que s'estàn fent servir codis duplicats

source: The fonts file %s was not found in <limesurvey root folder>/fonts directory. Please, see the txt file for your language in fonts directory.
ca_es: No s'ha trobat l'arxiu de fonts %s al directori <limesurvey root folder>/fonts. Si us plau, mireu l'arxiu txt del vostre idioma al vostre directori de fonts.

source: Sorry, but this question has too many answer options to be shown properly in a graph.
ca_es: Ho sentim, però aquesta pregunta te massa opcions de respostes per poder mostrar-les correctament en un gràfic.

source: Sorry, but this question has no responses yet so a graph cannot be shown.
ca_es: Ho sentim, però aquesta pregunta encara no té respostes i, per tant, no es pot mostrar cap gràfic.

source: Comments
ca_es: Comentaris

source: Total number of files
ca_es: Nombre total d'arxius

source: Average no. of files per respondent
ca_es: Núm. d'arxius mig per persona que respon

source: Total size of files
ca_es: Mida total dels arxius

source: Average file size
ca_es: Promig tamany arxiu

source: Average size per respondent
ca_es: Tamany promig per persona que respon

source: Field summary for %s
ca_es: Resum del camp per %s

source: Calculation
ca_es: Càlcul

source: Result
ca_es: Resultat

source: Sum
ca_es: Suma

source: Standard deviation
ca_es: Desviació estàndard

source: Average
ca_es: Promig

source: Count
ca_es: Comptar

source: 1st quartile (Q1)
ca_es: 1er quartil (Q1)

source: 2nd quartile (Median)
ca_es: 2on quartil (mediana)

source: 3rd quartile (Q3)
ca_es: 3er quartil (Q3)

source: Null values are ignored in calculations
ca_es: Els valors nuls són ignorats en els càlculs

source: Q1 and Q3 calculated using %s
ca_es: Q1 i Q3 calculats utilitzant %s
